app/views/home/find_album.html.erb

	<h3><%= album.name %></h3>
	<%album.images.each do |image|%>
---
SELECT `images`.* FROM `images`  WHERE `images`.`album_id` = 3