app/controllers/albums_controller.rb

SELECT `albums`.* FROM `albums`
---
  def index
    @albums = Album.all

SELECT `users`.* FROM `users`
---
  def new
    @album = Album.new
    @image = @album.images.build
    @user = User.all

SELECT  `albums`.* FROM `albums`  WHERE `albums`.`id` = 1 LIMIT 1
---
  def edit
    @album = Album.find(params[:id])

INSERT INTO `albums` (`created_at`, `name`, `updated_at`, `user_id`) VALUES ('2014-10-17 11:31:38', 'first', '2014-10-17 11:31:38', 1)
---
  def create
    @album = Album.new(album_params)
    respond_to do |format|
      if @album.save

UPDATE `albums` SET `name` = 'third', `updated_at` = '2014-10-18 07:13:30' WHERE `albums`.`id` = 7
---
  def update
    respond_to do |format|
      if @album.update(album_params)

DELETE FROM `albums` WHERE `albums`.`id` = 1
---
  def destroy
    @album.destroy

SELECT  `albums`.* FROM `albums`  WHERE `albums`.`id` = 3 LIMIT 1
---
    def set_album
      @album = Album.find(params[:id])