app/controllers/home_controller.rb

	def index
		@images = Image.order("id DESC").limit(25)
---
SELECT  `images`.* FROM `images`   ORDER BY `images`.`id` DESC LIMIT 25

	def find_album
		@find_album = Album.where("name LIKE ?", "%#{params[:album_name]}%")
---
SELECT `albums`.* FROM `albums`  WHERE (name LIKE ('a'))